JerrySkywalker/AdventCirno_RT1052_NNCU/board/pin_mux.c
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v7.0
processor: MIMXRT1052xxxxB
package_id: MIMXRT1052CVL5B
mcu_data: ksdk2_0
processor_version: 7.0.1
pin_labels:
- {pin_num: L6, pin_signal: WAKEUP, label: WEKAUP, identifier: WAKEUP}
- {pin_num: M6, pin_signal: ONOFF, label: ONOFF, identifier: ONOFF}
- {pin_num: D9, pin_signal: GPIO_B0_10, label: BT_CFG6/PD, identifier: WRX;WR}
- {pin_num: A10, pin_signal: GPIO_B0_11, label: BT_CFG7/PD, identifier: CSX;DC}
- {pin_num: L14, pin_signal: GPIO_AD_B0_13, label: DEBUG/RXD, identifier: DEBUG}
- {pin_num: K14, pin_signal: GPIO_AD_B0_12, label: DEBUG/TXD, identifier: DEBUG}
- {pin_num: F11, pin_signal: GPIO_AD_B0_04, label: ' PD/0_SPI/1_Serial Downloader/BOOT_MODE0/PD', identifier: BT_PD_0_SPI__1_SerialDownloader}
- {pin_num: G14, pin_signal: GPIO_AD_B0_05, label: bee PD/0/BOOT_MODE1/PU, identifier: BT_PD_0}
- {pin_num: A12, pin_signal: GPIO_B1_08, label: OLED/CLK, identifier: D0;C0}
- {pin_num: A13, pin_signal: GPIO_B1_09, label: OLED/DI, identifier: D1;C1}
- {pin_num: B13, pin_signal: GPIO_B1_10, label: OLED/DC, identifier: DC;OE_B}
- {pin_num: D13, pin_signal: GPIO_B1_12, label: CD, identifier: CD}
- {pin_num: H2, pin_signal: GPIO_SD_B0_04, label: D2, identifier: D2}
- {pin_num: J1, pin_signal: GPIO_SD_B0_02, label: D0, identifier: D0}
- {pin_num: J2, pin_signal: GPIO_SD_B0_05, label: D3, identifier: D3}
- {pin_num: J3, pin_signal: GPIO_SD_B0_01, label: CLK, identifier: CLK}
- {pin_num: J4, pin_signal: GPIO_SD_B0_00, label: CMD, identifier: CMD}
- {pin_num: K1, pin_signal: GPIO_SD_B0_03, label: D1, identifier: DATA1;D1}
- {pin_num: N3, pin_signal: GPIO_SD_B1_05, label: SDA, identifier: SDA}
- {pin_num: P2, pin_signal: GPIO_SD_B1_04, label: SCL, identifier: SCL}
- {pin_num: D7, pin_signal: GPIO_B0_00, label: KEY_5D, identifier: D0}
- {pin_num: E7, pin_signal: GPIO_B0_01, label: KEY_5D/上, identifier: D1}
- {pin_num: E8, pin_signal: GPIO_B0_02, label: KEY_5D, identifier: D2}
- {pin_num: D8, pin_signal: GPIO_B0_03, label: KEY_5D, identifier: D3}
- {pin_num: C8, pin_signal: GPIO_B0_04, label: BT_CFG0/PD, identifier: D4}
- {pin_num: B8, pin_signal: GPIO_B0_05, label: BT_CFG1/PD, identifier: D5}
- {pin_num: A8, pin_signal: GPIO_B0_06, label: 后轮L, identifier: D6}
- {pin_num: A9, pin_signal: GPIO_B0_07, label: 后轮L, identifier: D7}
- {pin_num: B11, pin_signal: GPIO_B1_01, label: BLUETOOTH/RX}
- {pin_num: A11, pin_signal: GPIO_B1_00, label: BLUETOOTH/TX}
- {pin_num: C10, pin_signal: GPIO_B0_12, label: BT_CFG8/PD, identifier: WR}
- {pin_num: D10, pin_signal: GPIO_B0_13, label: BT_CFG9/PD, identifier: DC}
- {pin_num: B9, pin_signal: GPIO_B0_08, label: 后轮R}
- {pin_num: C9, pin_signal: GPIO_B0_09, label: 后轮R}
- {pin_num: E10, pin_signal: GPIO_B0_14, label: BT_CFG10/PD}
- {pin_num: E11, pin_signal: GPIO_B0_15, label: OLED/RST, identifier: RST}
- {pin_num: L7, pin_signal: PMIC_STBY_REQ, label: 74LV245_OE_B, identifier: PMIC_STBY}
- {pin_num: J11, pin_signal: GPIO_AD_B1_00, label: 陀螺仪_SCL, identifier: SCL}
- {pin_num: K11, pin_signal: GPIO_AD_B1_01, label: 陀螺仪_SDA, identifier: SDA}
- {pin_num: B14, pin_signal: GPIO_B1_15, label: 编码器1}
- {pin_num: C14, pin_signal: GPIO_B1_14, label: 编码器1}
- {pin_num: D11, pin_signal: GPIO_B1_03, label: 编码器2}
- {pin_num: C11, pin_signal: GPIO_B1_02, label: 编码器2}
- {pin_num: M5, pin_signal: GPIO_SD_B1_01, label: PWM1}
- {pin_num: M3, pin_signal: GPIO_SD_B1_02, label: PWM4}
- {pin_num: M4, pin_signal: GPIO_SD_B1_03, label: PWM3}
- {pin_num: F14, pin_signal: GPIO_AD_B0_09, label: KEY_5D}
- {pin_num: M12, pin_signal: GPIO_AD_B1_03, label: K66外接/RX}
- {pin_num: L11, pin_signal: GPIO_AD_B1_02, label: K66外接/TX}
- {pin_num: M14, pin_signal: GPIO_AD_B0_00, label: Servo}
- {pin_num: E12, pin_signal: GPIO_B1_04, label: Buzz, identifier: BUZZ}
- {pin_num: K10, pin_signal: GPIO_AD_B1_07, label: ZZF_HSYNC, identifier: CSI_HSYNC}
- {pin_num: G11, pin_signal: GPIO_AD_B0_03, label: ZZF_TX, identifier: LPUART6_RX}
- {pin_num: H11, pin_signal: GPIO_AD_B1_13, label: ZZF_DATA04, identifier: CSI_DATA04}
- {pin_num: M11, pin_signal: GPIO_AD_B0_02, label: ZZF_RX, identifier: LPUART_TX}
- {pin_num: G12, pin_signal: GPIO_AD_B1_14, label: ZZF_DATA03, identifier: CSI_DATA03}
- {pin_num: H12, pin_signal: GPIO_AD_B1_12, label: ZZF_DATA05, identifier: CSI_DATA05}
- {pin_num: J12, pin_signal: GPIO_AD_B1_06, label: ZZF_VSYNC, identifier: CSI_VSYNC}
- {pin_num: L12, pin_signal: GPIO_AD_B1_04, label: ZZF_CLK, identifier: CSI_PIXCLK}
- {pin_num: H13, pin_signal: GPIO_AD_B1_08, label: ZZF_DATA09, identifier: CSI_DATA09}
- {pin_num: J13, pin_signal: GPIO_AD_B1_11, label: ZZF_DATA06, identifier: CSI_DATA06}
- {pin_num: L13, pin_signal: GPIO_AD_B1_10, label: ZZF_DATA07, identifier: CSI_DATA07}
- {pin_num: M13, pin_signal: GPIO_AD_B1_09, label: ZZF_DATA08, identifier: CSI_DATA08}
- {pin_num: J14, pin_signal: GPIO_AD_B1_15, label: ZZF_DATA02, identifier: CSI_DATA02}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

#include "fsl_common.h"
#include "fsl_xbara.h"
#include "fsl_iomuxc.h"
#include "fsl_gpio.h"
#include "pin_mux.h"

/* FUNCTION ************************************************************************************************************
 * 
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 * 
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void) {
    WDOG_B();
    SD();
    xSNVS();
    __camera();
    SWD();
    ENC();
    SPI();
    AC_GYRO_IIC();
    GPIO();
    AC_UART();
    AC_OLED();
    AC_KEY_5D();
    AC_PWM();
    AC_Buzz();
}

